app/controllers/bills_controller.rb

SELECT "bills".* FROM "bills"
---
  def index
    @bills = Bill.all

INSERT INTO "bills" ("title", "amount", "status", "date", "created_at", "updated_at") VALUES ('First Bill ', 5000.0, 'Not completed', '2025-06-22', '2025-06-22 03:59:31.801085', '2025-06-22 03:59:31.801085') RETURNING "id"
---
  def create
    @bill = Bill.new(bill_params)

    respond_to do |format|
      if @bill.save

SELECT "bills".* FROM "bills" WHERE "bills"."id" = 1 LIMIT 1
---
    def set_bill
      @bill = Bill.find(params.expect(:id))